In [1]:
import pandas as pd

In [2]:
dict1={'Name':['Rushi','Ram','Lakhan','Sita','Rama','Ragini','Rahul'],
       'Marks':[88,78,90,87,89,90,99],
       'Gender':['Male','Male','Male','Female','Female','Female','Male']}

In [11]:
df=pd.DataFrame(dict1,index=None)
df

     Name  Marks  Gender
0   Rushi     88    Male
1     Ram     78    Male
2  Lakhan     90    Male
3    Sita     87  Female
4    Rama     89  Female
5  Ragini     90  Female
6   Rahul     99    Male

In [12]:
# Top 3 rows
df.head(3)

     Name  Marks Gender
0   Rushi     88   Male
1     Ram     78   Male
2  Lakhan     90   Male

In [14]:
# last 3 rows
df.tail(3)

     Name  Marks  Gender
4    Rama     89  Female
5  Ragini     90  Female
6   Rahul     99    Male

In [15]:
# Find shape
df.shape

(7, 3)

In [16]:
print(f'Number of Rows:{df.shape[0]}')
print(f'Number of columns:{df.shape[1]}')

Number of Rows:7
Number of columns:3

In [17]:
# Get all information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [23]:
# check null values
df.isnull().sum()  # Displays null values count by column wise
df.isnull().sum(axis=1) # Displays null values count by row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [30]:
# Get overall statistics
df.describe() # This will show the statistice of only numeric column
# df.describe(include='all') # This will show statistics of all column

           Marks
count   7.000000
mean   88.714286
std     6.156684
min    78.000000
25%    87.500000
50%    89.000000
75%    90.000000
max    99.000000

In [34]:
# display unique values
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [37]:
# no. of unique values
df['Gender'].nunique() # find number of unique values from specific column

2

In [41]:
# count of unique values
df['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

In [44]:
# find no. of students having marks betwnn 90-100
df[df['Marks']>=90]

     Name  Marks  Gender
2  Lakhan     90    Male
5  Ragini     90  Female
6   Rahul     99    Male

In [49]:
df[(df['Marks']>=90) & (df['Marks']<=100)]

     Name  Marks  Gender
2  Lakhan     90    Male
5  Ragini     90  Female
6   Rahul     99    Male

In [54]:
df[df['Marks'].between(90,100)]

     Name  Marks  Gender
2  Lakhan     90    Male
5  Ragini     90  Female
6   Rahul     99    Male

In [58]:
# Find Average Marks
df['Marks'].mean()

np.float64(88.71428571428571)

In [65]:
# Apply Methods
df['Half_marks']=df['Marks'].apply(lambda x:x//2)

In [66]:
# Map Function
df

     Name  Marks  Gender  Male_Female  Half_marks
0   Rushi     88    Male            0          44
1     Ram     78    Male            0          39
2  Lakhan     90    Male            0          45
3    Sita     87  Female            1          43
4    Rama     89  Female            1          44
5  Ragini     90  Female            1          45
6   Rahul     99    Male            0          49

In [67]:
df['Male_Female']=df['Gender'].map({'Male':0,'Female':1})
df

     Name  Marks  Gender  Male_Female  Half_marks
0   Rushi     88    Male            0          44
1     Ram     78    Male            0          39
2  Lakhan     90    Male            0          45
3    Sita     87  Female            1          43
4    Rama     89  Female            1          44
5  Ragini     90  Female            1          45
6   Rahul     99    Male            0          49

In [70]:
# Drop the columns
df.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [74]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [75]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [77]:
# Sort the table 
df.sort_values(by='Marks',ascending=False)

     Name  Marks  Gender
6   Rahul     99    Male
5  Ragini     90  Female
2  Lakhan     90    Male
4    Rama     89  Female
0   Rushi     88    Male
3    Sita     87  Female
1     Ram     78    Male

In [ ]:
# display name and marks of female
df[df['Gender'].isin(['Female'])][['Name','Marks']]

     Name  Marks
3    Sita     87
4    Rama     89
5  Ragini     90